public class Task_1 {
    public static void printString(String str){
        System.out.println("Переданная строка: " + str);
    }
    public static void main(String[] args) {
        String str = new String("I study Basic Java!");
        // Создание строки через new
        //--------------------------------------------------------------------------------------------------------------
        printString(str);
        // Передача строки в метод для вывода на экран
        System.out.println("-".repeat(80));
        //--------------------------------------------------------------------------------------------------------------
        char lastChar = str.charAt(str.length()- 1);
        System.out.println("Последний символ строки: " + lastChar);
        // Вывод последнего символа строки на экран
        System.out.println("-".repeat(80));
        //--------------------------------------------------------------------------------------------------------------
        boolean containsJava = str.contains("Java");
        System.out.println("Строка содержит подстроку 'Java': " + containsJava);
        // Проверка наличия подстроки и в данный момент результат true
        System.out.println("-".repeat(80));
        //--------------------------------------------------------------------------------------------------------------
        String replacedStr = str.replace('a','o');
        System.out.println("Строка с заменой символов 'a' на 'o': " + replacedStr);
        // Вывод строки на экран у которой заменили символы 'а' на 'о'
        System.out.println("-".repeat(80));
        //--------------------------------------------------------------------------------------------------------------
        String lowerCase = str.toLowerCase();
        System.out.println("Строка преобразована в нижний регистр: " + lowerCase);
        // Вывод строки на экран в нижнем регистре
        System.out.println("-".repeat(80));
        //--------------------------------------------------------------------------------------------------------------
        String upperCase = str.toUpperCase();
        System.out.println("Строка преобразована в верхний регистр: " + upperCase);
        // Вывод строки на экран в верхнем регистре
        System.out.println("-".repeat(80));
        //--------------------------------------------------------------------------------------------------------------
    }
}
